Revit 2027 API
RebarFreeFormAccessor.GetCrankTypeIdAtIndex Method
 Gets the id of the Rebar Crank Type that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetCrankTypeIdAtIndex(
	int barPositionIndex,
	int end
)
Public Function GetCrankTypeIdAtIndex (
	barPositionIndex As Integer,
	end As Integer
) As ElementId
public:
ElementId^ GetCrankTypeIdAtIndex(
	int barPositionIndex,
	int end
)
member GetCrankTypeIdAtIndex :
        barPositionIndex : int *
        end : int -> ElementId
Parameters
barPositionIndex Int32
 An index between 0 and (NumberOfBarPositions-1).
end Int32
 0 for the start hook, 1 for the end crank.
Return Value
ElementId
 The id of a Rebar Crank Type, or invalidElementId if the rebar has no crank at the specified end.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  end must be 0 or 1. -or- barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Remarks
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetCrankTypeId(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetCrankTypeId(int end).
All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetCrankTypeId(int end).
Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the id of the Rebar Crank Type at the opposite end. For the others bars will return the same as Rebar.GetCrankTypeId(int end).
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace